//Console.WriteLine("Input number: "); //
//int num = Convert.ToInt32(Console.ReadLine());//создаем переменную, которая хранит целые числа используя конвертатор строки в число
//Console.WriteLine($"Your number -> {num} ");

//Задача 1. Напишите программу, которая на вход принимает число и выдает его квадрат

//Console.WriteLine("Input number: ");
//int num = Convert.ToInt32(Console.ReadLine());
//Console.WriteLine($"Quad of {num} -> {num*num}");

//Задача 2. Напишите программу, которая принимает на вход трехзначное число и на выходе показывает последнюю цифру этого числа
//Console.WriteLine("Input three-digit number: ");
//int num = Convert.ToInt32(Console.ReadLine());
//if(num >= 100 && num < 1000)
//{
//    Console.WriteLine($"Last digit of {num} -> {num%10}");
//}
//else 
//{
//    Console.WriteLine("you input not three-digit number");
//}

//Задача 3. Вводим число n, выводим с противоположного до n

//Console.WriteLine("input number");
//int n = Conver.ToInt32(Console.ReadLine());
//int count = -n;
//while (count <= n)
//  Console.WriteLine(count++ + " ");

//либо так
//Console.WriteLine("input number: ");
//int n = Conver.ToInt32(Console.ReadLine());
//int m = n*(-1);
//while (m <= n)
//{
//    Console.Write($"{m++} ",");
//}
